const competenceData = [
    {
        id: 1,
        name: "Kotlin",
        description: "Необходимый язык для раработки android приложений",
        progress: 86
    },
    {
        id: 2,
        name: "Java",
        description: "Mощный и популярный язык программирования, используемый для создания различных приложений.",
        progress: 44
    },
    {
        id: 3,
        name: "C++",
        description: "Bысокоуровневый язык программирования, используемый для разработки системного и прикладного программного обеспечения.",
        progress: 81
    },
    {
        id: 4,
        name: "Swift",
        description: "Cовременный язык программирования, разработанный компанией Apple для создания приложений под iOS и macOS.",
        progress: 43
    },
    {
        id: 5,
        name: "PHP",
        description: "Cкриптовый язык программирования, часто используемый для создания веб-сайтов.",
        progress: 78
    },
    {
        id: 6,
        name: "R",
        description: "Язык программирования и среда разработки, специализирующиеся на статистическом анализе данных.",
        progress: 12
    },
    {
        id: 7,
        name: "Go",
        description: "Язык программирования, созданный компанией Google, известен своей производительностью и простотой.",
        progress: 52
    },
    {
        id: 8,
        name: "TypeScript ",
        description: "Язык программирования, расширяющий возможности JavaScript с помощью статической типизации.",
        progress: 67
    },
    {
        id: 9,
        name: "Scala",
        description: "Язык программирования, совмещающий преимущества функционального и объектно-ориентированного программирования.",
        progress: 34
    },
    {
        id: 10,
        name: "Perl",
        description: "Универсальный язык программирования, хорошо подходящий для обработки текстовой информации.",
        progress: 10
    },
]

export default competenceData